TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/flash/uart_flash_kernel/flash_programming_F29H85x_C29.h
//#############################################################################
//
// FILE:   flash_programming_F29H85x.h
//
// TITLE:  A set of Constant Values for the F29H85x Family.
//
//###########################################################################
// $TI Release:  $
// $Release Date:  $
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################
#ifndef FLASH_PROGRAMMING_F29H85XH_
#define FLASH_PROGRAMMING_F29H85XH_

//----------------------------------------------------------------------------------------
//  C29 banks : Main Array
//----------------------------------------------------------------------------------------
//FR-1 RP0
#define C29FlashBankFR1RP0StartAddress                   (uint32_t)(0x10000000)
#define C29FlashBankFR1RP0EndAddress                     (uint32_t)(0x100FFFFF)
#define C29FlashBankFR1RP0EndAddressPlus1                (uint32_t)(0x10100000)

//FR-1 RP1
#define C29FlashBankFR1RP1StartAddress                   (uint32_t)(0x10100000)
#define C29FlashBankFR1RP1EndAddress                     (uint32_t)(0x101FFFFF)
#define C29FlashBankFR1RP1EndAddressPlus1                (uint32_t)(0x10200000)

//FR-1 RP2
#define C29FlashBankFR1RP2StartAddress                   (uint32_t)(0x10200000)
#define C29FlashBankFR1RP2EndAddress                     (uint32_t)(0x102FFFFF)
#define C29FlashBankFR1RP2EndAddressPlus1                (uint32_t)(0x10300000)

//FR-1 RP3
#define C29FlashBankFR1RP3StartAddress                   (uint32_t)(0x10300000)
#define C29FlashBankFR1RP3EndAddress                     (uint32_t)(0x103FFFFF)
#define C29FlashBankFR1RP3EndAddressPlus1                (uint32_t)(0x10400000)

//FR-2 RP0
#define C29FlashBankFR2RP0StartAddress                   (uint32_t)(0x10400000)
#define C29FlashBankFR2RP0EndAddress                     (uint32_t)(0x104FFFFF)
#define C29FlashBankFR2RP0EndAddressPlus1                (uint32_t)(0x10500000)

//FR-2 RP1
#define C29FlashBankFR2RP1StartAddress                   (uint32_t)(0x10500000)
#define C29FlashBankFR2RP1EndAddress                     (uint32_t)(0x105FFFFF)
#define C29FlashBankFR2RP1EndAddressPlus1                (uint32_t)(0x10600000)

//FR-3 RP0
#define C29FlashBankFR3RP0StartAddress                   (uint32_t)(0x10600000)
#define C29FlashBankFR3RP0EndAddress                     (uint32_t)(0x106FFFFF)
#define C29FlashBankFR3RP0EndAddressPlus1                (uint32_t)(0x10700000)

//FR-3 RP1
#define C29FlashBankFR3RP1StartAddress                   (uint32_t)(0x10700000)
#define C29FlashBankFR3RP1EndAddress                     (uint32_t)(0x107FFFFF)
#define C29FlashBankFR3RP1EndAddressPlus1                (uint32_t)(0x10800000)

//FR-4 RP0 data flash
#define C29FlashBankFR4RP0StartAddress                   (uint32_t)(0x10C00000)
#define C29FlashBankFR4RP0EndAddress                     (uint32_t)(0x10C3FFFF)
#define C29FlashBankFR4RP0EndAddressPlus1                (uint32_t)(0x10C40000)

//----------------------------------------------------------------------------------------
//  HSM C29 banks : Main Array ECC
//----------------------------------------------------------------------------------------
//FR-1 RP0 ECC
#define C29FlashBankFR1RP0EccStartAddress                   (uint32_t)(0x10E00000)
#define C29FlashBankFR1RP0EccEndAddress                     (uint32_t)(0x10E1FFFF)
#define C29FlashBankFR1RP0EccEndAddressPlus1                (uint32_t)(0x10E20000)

//FR-1 RP1 ECC
#define C29FlashBankFR1RP1EccStartAddress                   (uint32_t)(0x10E20000)
#define C29FlashBankFR1RP1EccEndAddress                     (uint32_t)(0x10E3FFFF)
#define C29FlashBankFR1RP1EccEndAddressPlus1                (uint32_t)(0x10E40000)

//FR-1 RP2 ECC
#define C29FlashBankFR1RP2EccStartAddress                   (uint32_t)(0x10E40000)
#define C29FlashBankFR1RP2EccEndAddress                     (uint32_t)(0x10E5FFFF)
#define C29FlashBankFR1RP2EccEndAddressPlus1                (uint32_t)(0x10E60000)

//FR-1 RP3 ECC
#define C29FlashBankFR1RP3EccStartAddress                   (uint32_t)(0x10E60000)
#define C29FlashBankFR1RP3EccEndAddress                     (uint32_t)(0x10E7FFFF)
#define C29FlashBankFR1RP3EccEndAddressPlus1                (uint32_t)(0x10E80000)

//FR-2 RP0 ECC
#define C29FlashBankFR2RP0EccStartAddress                   (uint32_t)(0x10E80000)
#define C29FlashBankFR2RP0EccEndAddress                     (uint32_t)(0x10E9FFFF)
#define C29FlashBankFR2RP0EccEndAddressPlus1                (uint32_t)(0x10EA0000)

