TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/flash/uart_flash_kernel/flash_programming_F29H85x_C29.h
//FR-2 RP1 ECC
#define C29FlashBankFR2RP1EccStartAddress                   (uint32_t)(0x10EA0000)
#define C29FlashBankFR2RP1EccEndAddress                     (uint32_t)(0x10EBFFFF)
#define C29FlashBankFR2RP1EccEndAddressPlus1                (uint32_t)(0x10EC0000)

//FR-3 RP0 ECC
#define C29FlashBankFR3RP0EccStartAddress                   (uint32_t)(0x10EC0000)
#define C29FlashBankFR3RP0EccEndAddress                     (uint32_t)(0x10EDFFFF)
#define C29FlashBankFR3RP0EccEndAddressPlus1                (uint32_t)(0x10EE0000)

//FR-3 RP1 ECC
#define C29FlashBankFR3RP1EccStartAddress                   (uint32_t)(0x10EE0000)
#define C29FlashBankFR3RP1EccEndAddress                     (uint32_t)(0x10EFFFFF)
#define C29FlashBankFR3RP1EccEndAddressPlus1                (uint32_t)(0x10F00000)


//FR-4 RP0 ECC data flash
#define C29FlashBankFR4RP0EccStartAddress                   (uint32_t)(0x10F80000)
#define C29FlashBankFR4RP0EccEndAddress                     (uint32_t)(0x10F9FFFF)
#define C29FlashBankFR4RP0EccEndAddressPlus1                (uint32_t)(0x10FA0000)

//----------------------------------------------------------------------------------------
//  HSM C29 banks : Non-Main Array
//----------------------------------------------------------------------------------------
//FR-1 RP0 Bnkmgmt
#define C29FlashBankFR1RP0BnkmgmtStartAddress                   (uint32_t)(0x10D80000)
#define C29FlashBankFR1RP0BnkmgmtEndAddress                     (uint32_t)(0x10D80FFF)
#define C29FlashBankFR1RP0BnkmgmtEndAddressPlus1                (uint32_t)(0x10D81000)

//FR-1 RP0 Seccfg
#define C29FlashBankFR1RP0SeccfgStartAddress                   (uint32_t)(0x10D81000)
#define C29FlashBankFR1RP0SeccfgEndAddress                     (uint32_t)(0x10D81FFF)
#define C29FlashBankFR1RP0SeccfgEndAddressPlus1                (uint32_t)(0x10D82000)

//FR-1 RP1 Bnkmgmt
#define C29FlashBankFR1RP1BnkmgmtStartAddress                   (uint32_t)(0x10D84000)
#define C29FlashBankFR1RP1BnkmgmtEndAddress                     (uint32_t)(0x10D84FFF)
#define C29FlashBankFR1RP1BnkmgmtEndAddressPlus1                (uint32_t)(0x10D85000)

//FR-1 RP1 Seccfg
#define C29FlashBankFR1RP1SeccfgStartAddress                   (uint32_t)(0x10D85000)
#define C29FlashBankFR1RP1SeccfgEndAddress                     (uint32_t)(0x10D85FFF)
#define C29FlashBankFR1RP1SeccfgEndAddressPlus1                (uint32_t)(0x10D86000)

//FR-1 RP2 Bnkmgmt
#define C29FlashBankFR1RP2BnkmgmtStartAddress                   (uint32_t)(0x10D88000)
#define C29FlashBankFR1RP2BnkmgmtEndAddress                     (uint32_t)(0x10D88FFF)
#define C29FlashBankFR1RP2BnkmgmtEndAddressPlus1                (uint32_t)(0x10D89000)

//FR-1 RP2 Seccfg
#define C29FlashBankFR1RP2SeccfgStartAddress                   (uint32_t)(0x10D89000)
#define C29FlashBankFR1RP2SeccfgEndAddress                     (uint32_t)(0x10D89FFF)
#define C29FlashBankFR1RP2SeccfgEndAddressPlus1                (uint32_t)(0x10D8A000)

//FR-1 RP3 Bnkmgmt
#define C29FlashBankFR1RP3BnkmgmtStartAddress                   (uint32_t)(0x10D8C000)
#define C29FlashBankFR1RP3BnkmgmtEndAddress                     (uint32_t)(0x10D8CFFF)
#define C29FlashBankFR1RP3BnkmgmtEndAddressPlus1                (uint32_t)(0x10D8D000)

//FR-1 RP3 Seccfg
#define C29FlashBankFR1RP3SeccfgStartAddress                   (uint32_t)(0x10D8D000)
#define C29FlashBankFR1RP3SeccfgEndAddress                     (uint32_t)(0x10D8DFFF)
#define C29FlashBankFR1RP3SeccfgEndAddressPlus1                (uint32_t)(0x10D8E000)

//FR-2 RP0 Bnkmgmt
#define C29FlashBankFR2RP0BnkmgmtStartAddress                   (uint32_t)(0x10D90000)
#define C29FlashBankFR2RP0BnkmgmtEndAddress                     (uint32_t)(0x10D90FFF)
#define C29FlashBankFR2RP0BnkmgmtEndAddressPlus1                (uint32_t)(0x10D91000)

//FR-2 RP0 Seccfg
#define C29FlashBankFR2RP0SeccfgStartAddress                   (uint32_t)(0x10D91000)
#define C29FlashBankFR2RP0SeccfgEndAddress                     (uint32_t)(0x10D91FFF)
#define C29FlashBankFR2RP0SeccfgEndAddressPlus1                (uint32_t)(0x10D92000)

//FR-2 RP1 Bnkmgmt
#define C29FlashBankFR2RP1BnkmgmtStartAddress                   (uint32_t)(0x10D94000)
#define C29FlashBankFR2RP1BnkmgmtEndAddress                     (uint32_t)(0x10D94FFF)
#define C29FlashBankFR2RP1BnkmgmtEndAddressPlus1                (uint32_t)(0x10D95000)

//FR-2 RP1 Seccfg
#define C29FlashBankFR2RP1SeccfgStartAddress                   (uint32_t)(0x10D95000)
#define C29FlashBankFR2RP1SeccfgEndAddress                     (uint32_t)(0x10D95FFF)
#define C29FlashBankFR2RP1SeccfgEndAddressPlus1                (uint32_t)(0x10D96000)

//FR-3 RP0 Bnkmgmt
#define C29FlashBankFR3RP0BnkmgmtStartAddress                   (uint32_t)(0x10D98000)
#define C29FlashBankFR3RP0BnkmgmtEndAddress                     (uint32_t)(0x10D98FFF)
#define C29FlashBankFR3RP0BnkmgmtEndAddressPlus1                (uint32_t)(0x10D99000)

//FR-3 RP0 Seccfg
#define C29FlashBankFR3RP0SeccfgStartAddress                   (uint32_t)(0x10D99000)
#define C29FlashBankFR3RP0SeccfgEndAddress                     (uint32_t)(0x10D99FFF)
#define C29FlashBankFR3RP0SeccfgEndAddressPlus1                (uint32_t)(0x10D9A000)

//FR-3 RP1 Bnkmgmt
#define C29FlashBankFR3RP1BnkmgmtStartAddress                   (uint32_t)(0x10D9C000)
#define C29FlashBankFR3RP1BnkmgmtEndAddress                     (uint32_t)(0x10D9CFFF)
#define C29FlashBankFR3RP1BnkmgmtEndAddressPlus1                (uint32_t)(0x10D9D000)

//FR-3 RP1 Seccfg
#define C29FlashBankFR3RP1SeccfgStartAddress                   (uint32_t)(0x10D9D000)
#define C29FlashBankFR3RP1SeccfgEndAddress                     (uint32_t)(0x10D9DFFF)
#define C29FlashBankFR3RP1SeccfgEndAddressPlus1                (uint32_t)(0x10D9E000)

//FR-4 RP0 Data Flash
#define C29FlashBankFR4RP0BnkmgmtStartAddress                   (uint32_t)(0x10D9E000)
#define C29FlashBankFR4RP0BnkmgmtEndAddress                     (uint32_t)(0x10D9EFFF)
#define C29FlashBankFR4RP0BnkmgmtEndAddressPlus1                (uint32_t)(0x10D9F000)

