TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/flash/uart_flash_kernel/flash_programming_F29H85x_C29.h
//----------------------------------------------------------------------------------------
//  HSM C29 banks : Non-Main Array ECC
//----------------------------------------------------------------------------------------
//FR-1 RP0 Bnkmgmt Ecc
#define C29FlashBankFR1RP0BnkmgmtEccStartAddress                   (uint32_t)(0x10FB0000)
#define C29FlashBankFR1RP0BnkmgmtEccEndAddress                     (uint32_t)(0x10FB01FF)
#define C29FlashBankFR1RP0BnkmgmtEccEndAddressPlus1                (uint32_t)(0x10FB0200)

//FR-1 RP0 Seccfg Ecc
#define C29FlashBankFR1RP0SeccfgEccStartAddress                   (uint32_t)(0x10FB0200)
#define C29FlashBankFR1RP0SeccfgEccEndAddress                     (uint32_t)(0x10FB03FF)
#define C29FlashBankFR1RP0SeccfgEccEndAddressPlus1                (uint32_t)(0x10FB0400)

//FR-1 RP1 Bnkmgmt Ecc
#define C29FlashBankFR1RP1BnkmgmtEccStartAddress                   (uint32_t)(0x10FB0800)
#define C29FlashBankFR1RP1BnkmgmtEccEndAddress                     (uint32_t)(0x10FB09FF)
#define C29FlashBankFR1RP1BnkmgmtEccEndAddressPlus1                (uint32_t)(0x10FB0A00)

//FR-1 RP1 Seccfg Ecc
#define C29FlashBankFR1RP1SeccfgEccStartAddress                   (uint32_t)(0x10FB0A00)
#define C29FlashBankFR1RP1SeccfgEccEndAddress                     (uint32_t)(0x10FB0BFF)
#define C29FlashBankFR1RP1SeccfgEccEndAddressPlus1                (uint32_t)(0x10FB0C00)

//FR-1 RP2 Bnkmgmt Ecc
#define C29FlashBankFR1RP2BnkmgmtEccStartAddress                   (uint32_t)(0x10FB1000)
#define C29FlashBankFR1RP2BnkmgmtEccEndAddress                     (uint32_t)(0x10FB11FF)
#define C29FlashBankFR1RP2BnkmgmtEccEndAddressPlus1                (uint32_t)(0x10FB1200)

//FR-1 RP2 Seccfg Ecc
#define C29FlashBankFR1RP2SeccfgEccStartAddress                   (uint32_t)(0x10FB1200)
#define C29FlashBankFR1RP2SeccfgEccEndAddress                     (uint32_t)(0x10FB13FF)
#define C29FlashBankFR1RP2SeccfgEccEndAddressPlus1                (uint32_t)(0x10FB1400)

//FR-1 RP3 Bnkmgmt Ecc
#define C29FlashBankFR1RP3BnkmgmtEccStartAddress                   (uint32_t)(0x10FB1800)
#define C29FlashBankFR1RP3BnkmgmtEccEndAddress                     (uint32_t)(0x10FB19FF)
#define C29FlashBankFR1RP3BnkmgmtEccEndAddressPlus1                (uint32_t)(0x10FB1A00)

//FR-1 RP3 Seccfg Ecc
#define C29FlashBankFR1RP3SeccfgEccStartAddress                   (uint32_t)(0x10FB1A00)
#define C29FlashBankFR1RP3SeccfgEccEndAddress                     (uint32_t)(0x10FB1BFF)
#define C29FlashBankFR1RP3SeccfgEccEndAddressPlus1                (uint32_t)(0x10FB1C00)

//FR-2 RP0 Bnkmgmt Ecc
#define C29FlashBankFR2RP0BnkmgmtEccStartAddress                   (uint32_t)(0x10FB2000)
#define C29FlashBankFR2RP0BnkmgmtEccEndAddress                     (uint32_t)(0x10FB21FF)
#define C29FlashBankFR2RP0BnkmgmtEccEndAddressPlus1                (uint32_t)(0x10FB2200)

//FR-2 RP0 Seccfg Ecc
#define C29FlashBankFR2RP0SeccfgEccStartAddress                   (uint32_t)(0x10FB2200)
#define C29FlashBankFR2RP0SeccfgEccEndAddress                     (uint32_t)(0x10FB23FF)
#define C29FlashBankFR2RP0SeccfgEccEndAddressPlus1                (uint32_t)(0x10FB2400)

//FR-2 RP1 Bnkmgmt Ecc
#define C29FlashBankFR2RP1BnkmgmtEccStartAddress                   (uint32_t)(0x10FB2800)
#define C29FlashBankFR2RP1BnkmgmtEccEndAddress                     (uint32_t)(0x10FB29FF)
#define C29FlashBankFR2RP1BnkmgmtEccEndAddressPlus1                (uint32_t)(0x10FB2A00)

//FR-2 RP1 Seccfg Ecc
#define C29FlashBankFR2RP1SeccfgEccStartAddress                   (uint32_t)(0x10FB2A00)
#define C29FlashBankFR2RP1SeccfgEccEndAddress                     (uint32_t)(0x10FB2BFF)
#define C29FlashBankFR2RP1SeccfgEccEndAddressPlus1                (uint32_t)(0x10FB2C00)

//FR-3 RP0 Bnkmgmt Ecc
#define C29FlashBankFR3RP0BnkmgmtEccStartAddress                   (uint32_t)(0x10FB3000)
#define C29FlashBankFR3RP0BnkmgmtEccEndAddress                     (uint32_t)(0x10FB31FF)
#define C29FlashBankFR3RP0BnkmgmtEccEndAddressPlus1                (uint32_t)(0x10FB3200)

//FR-3 RP0 Seccfg Ecc
#define C29FlashBankFR3RP0SeccfgEccStartAddress                   (uint32_t)(0x10FB3200)
#define C29FlashBankFR3RP0SeccfgEccEndAddress                     (uint32_t)(0x10FB33FF)
#define C29FlashBankFR3RP0SeccfgEccEndAddressPlus1                (uint32_t)(0x10FB3400)

//FR-3 RP1 Bnkmgmt Ecc
#define C29FlashBankFR3RP1BnkmgmtEccStartAddress                   (uint32_t)(0x10FB3800)
#define C29FlashBankFR3RP1BnkmgmtEccEndAddress                     (uint32_t)(0x10FB39FF)
#define C29FlashBankFR3RP1BnkmgmtEccEndAddressPlus1                (uint32_t)(0x10FB3A00)

//FR-3 RP1 Seccfg Ecc
#define C29FlashBankFR3RP1SeccfgEccStartAddress                   (uint32_t)(0x10FB3A00)
#define C29FlashBankFR3RP1SeccfgEccEndAddress                     (uint32_t)(0x10FB3BFF)
#define C29FlashBankFR3RP1SeccfgEccEndAddressPlus1                (uint32_t)(0x10FB3C00)

//FR-4 RP0 Data flash
#define C29FlashBankFR4RP0BnkmgmtEccStartAddress                   (uint32_t)(0x10FB4000)
#define C29FlashBankFR4RP0BnkmgmtEccEndAddress                     (uint32_t)(0x10FB41FF)
#define C29FlashBankFR4RP0BnkmgmtEccEndAddressPlus1                (uint32_t)(0x10FB4200)


#if 0
// HSM Bank0 Sector start addresses
#define     FlashBank0StartAddress      0x10000000U
#define     Bzero_Sector0_start         0x10000000U
#define     FlashBank0EndAddress        0x10040000U
// HSM Bank1 Sector start addresses
#define     FlashBank1StartAddress      0x10040000U   //0x10000000U
#define     Bone_Sector0_start          0x10040000U      //
#define     FlashBank1EndAddress        0x10080000U

// C29 view Bank0 Sector start addresses : Mode 0
#define     FlashC29BankRP0StartAddress    0x10000000U
#define     BzeroC29_Sector0_start         0x10000000U
//#define     BzeroC29_Sector1_start         0x10080000U
#define     FlashC29BankRP0EndAddress      0x100FFFFFU

#define     FlashC29BankRP1StartAddress    0x10100000U
#define     BoneC29_Sector0_start          0x10100000U
#define     FlashC29BankRP1EndAddress      0x101FFFFFU

