TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/flash/uart_flash_kernel/flash_programming_F29H85x_C29.h
#define     FlashC29BankRP2StartAddress    0x10200000U
#define     BtwoC29_Sector0_start          0x10200000U
#define     FlashC29BankRP2EndAddress      0x102FFFFFU

#define     FlashC29BankRP3StartAddress    0x10300000U

#define     FlashC29BankRP3EndAddress      0x103FFFFFU

// C29 view Bank0 Sector start addresses : Mode 2

#define     FlashFR1_RP0StartAddress    0x10000000U
#define     FlashFR1_RP0EndAddress      0x100FFFFFU

#define     FlashFR1_RP1StartAddress    0x10100000U
#define     FlashFR1_RP1EndAddress      0x101FFFFFU

#define     FlashFR2_RP0StartAddress    0x10400000U
#define     FlashFR2_RP0EndAddress      0x104FFFFFU

#define     FlashFR2_RP0ECCStartAddress    0x10E80000U
#define     FlashFR2_RP0ECCEndAddress      0x10E9FFFFU

#define     FlashFR2_RP1StartAddress    0x10500000U
#define     FlashFR2_RP1EndAddress      0x105FFFFFU


// C29 view Bank0 Sector start addresses : Mode 1
//Main array address: Mode 1
#define     FlashFR1_Mode1RP0StartAddress    0x10000000U
#define     FlashFR1_Mode1RP0EndAddress      0x100FFFFFU

#define     FlashFR1_Mode1RP1StartAddress    0x10100000U
#define     FlashFR1_Mode1RP1EndAddress      0x101FFFFFU

#define     FlashFR3_Mode1RP0StartAddress    0x10600000U
#define     FlashFR3_Mode1RP0EndAddress      0x106FFFFFU

#define     FlashFR3_Mode1RP1StartAddress    0x10700000U
#define     FlashFR3_Mode1RP1EndAddress      0x107FFFFFU

//Main array ECC address: Mode 1
#define     FlashFR1_Mode1RP0ECCStartAddress    0x10E00000U
#define     FlashFR1_Mode1RP0ECCEndAddress      0x10E1FFFFU
#define     FlashFR1_Mode1RP0ECCEndAddressPlus1 0x10E20000U

#define     FlashFR1_Mode1RP1ECCStartAddress    0x10E20000U
#define     FlashFR1_Mode1RP1ECCEndAddress      0x10E3FFFFU
#define     FlashFR1_Mode1RP1ECCEndAddressPlus1 0x10E40000U

#define     FlashFR3_Mode1RP0ECCStartAddress    0x10EC0000U
#define     FlashFR3_Mode1RP0ECCEndAddress      0x10EDFFFFU
#define     FlashFR3_Mode1RP0ECCEndAddressPlus1 0x10EE0000U

#define     FlashFR3_Mode1RP1ECCStartAddress    0x10EE0000U
#define     FlashFR3_Mode1RP1ECCEndAddress      0x10EFFFFFU
#define     FlashFR3_Mode1RP1ECCEndAddressPlus1 0x10F00000U

//Non-Main array address: Mode 1
//BANKMGMT
#define     FlashFR1_Mode1RP0BankmgmtStartAddress    0x10D80000U
#define     FlashFR1_Mode1RP0BankmgmtEndAddress      0x10D80FFFU
#define     FlashFR1_Mode1RP0BankmgmtEndAddressPlus1 0x10D81000U
//SECCFG
#define     FlashFR1_Mode1RP0SeccfgStartAddress      0x10D81000U
#define     FlashFR1_Mode1RP0SeccfgEndAddress        0x10D81FFFU
#define     FlashFR1_Mode1RP0SeccfgEndAddressPlus1   0x10D82000U
//BANKMGMT
#define     FlashFR1_Mode1RP1BankmgmtStartAddress    0x10D84000U
#define     FlashFR1_Mode1RP1BankmgmtEndAddress      0x10D84FFFU
#define     FlashFR1_Mode1RP1BankmgmtEndAddressPlus1 0x10D85000U
//SECCFG
#define     FlashFR1_Mode1RP1SeccfgStartAddress      0x10D85000U
#define     FlashFR1_Mode1RP1SeccfgEndAddress        0x10D85FFFU
#define     FlashFR1_Mode1RP1SeccfgEndAddressPlus1   0x10D86000U
//BANKMGMT
#define     FlashFR3_Mode1RP0BankmgmtStartAddress    0x10D98000U
#define     FlashFR3_Mode1RP0BankmgmtEndAddress      0x10D98FFFU
#define     FlashFR3_Mode1RP0BankmgmtEndAddressPlus1 0x10D99000U
//SECCFG
#define     FlashFR3_Mode1RP0SeccfgStartAddress      0x10D99000U
#define     FlashFR3_Mode1RP0SeccfgEndAddress        0x10D99FFFU
#define     FlashFR3_Mode1RP0SeccfgEndAddressPlus1   0x10D9A000U
//BANKMGMT
#define     FlashFR3_Mode1RP1BankmgmtStartAddress    0x10D9C000U
#define     FlashFR3_Mode1RP1BankmgmtEndAddress      0x10D9CFFFU
#define     FlashFR3_Mode1RP1BankmgmtEndAddressPlus1 0x10D9D000U
//SECCFG
#define     FlashFR3_Mode1RP1SeccfgStartAddress      0x10D9D000U
#define     FlashFR3_Mode1RP1SeccfgEndAddress        0x10D9DFFFU
#define     FlashFR3_Mode1RP1SeccfgEndAddressPlus1   0x10D9E000U


//Non-Main ECC array address: Mode 1
//BANKMGMT ECC
#define     FlashFR1_Mode1RP0ECCBankmgmtStartAddress    0x10FC0000U
#define     FlashFR1_Mode1RP0ECCBankmgmtEndAddress      0x10FC01FFU
#define     FlashFR1_Mode1RP0ECCBankmgmtEndAddressPlus1 0x10FC0200U
//SECCFG
#define     FlashFR1_Mode1RP0ECCSeccfgStartAddress      0x10FC0200U
#define     FlashFR1_Mode1RP0ECCSeccfgEndAddress        0x10FC03FFU
#define     FlashFR1_Mode1RP0ECCSeccfgEndAddressPlus1   0x10FC0400U
//BANKMGMT
#define     FlashFR1_Mode1RP1ECCBankmgmtStartAddress    0x10FC0800U
#define     FlashFR1_Mode1RP1ECCBankmgmtEndAddress      0x10FC09FFU
#define     FlashFR1_Mode1RP1ECCBankmgmtEndAddressPlus1 0x10FC0A00U
//SECCFG
#define     FlashFR1_Mode1RP1ECCSeccfgStartAddress      0x10FC0A00U
#define     FlashFR1_Mode1RP1ECCSeccfgEndAddress        0x10FC0BFFU
#define     FlashFR1_Mode1RP1ECCSeccfgEndAddressPlus1   0x10FC0C00U
//BANKMGMT
#define     FlashFR3_Mode1RP0ECCBankmgmtStartAddress    0x10FC3000U
#define     FlashFR3_Mode1RP0ECCBankmgmtEndAddress      0x10FC31FFU
#define     FlashFR3_Mode1RP0ECCBankmgmtEndAddressPlus1 0x10FC3200U
//SECCFG
#define     FlashFR3_Mode1RP0ECCSeccfgStartAddress      0x10FC3200U
#define     FlashFR3_Mode1RP0ECCSeccfgEndAddress        0x10FC33FFU
#define     FlashFR3_Mode1RP0ECCSeccfgEndAddressPlus1   0x10FC3400U
//BANKMGMT
#define     FlashFR3_Mode1RP1ECCBankmgmtStartAddress    0x10FC3800U
#define     FlashFR3_Mode1RP1ECCBankmgmtEndAddress      0x10FC39FFU
#define     FlashFR3_Mode1RP1ECCBankmgmtEndAddressPlus1 0x10FC3A00U
//SECCFG
#define     FlashFR3_Mode1RP1ECCSeccfgStartAddress      0x10FC3A00U
#define     FlashFR3_Mode1RP1ECCSeccfgEndAddress        0x10FC3BFFU
#define     FlashFR3_Mode1RP1ECCSeccfgEndAddressPlus1   0x10FC3C00U



// C29 view Bank0 Sector start addresses : Mode 3
//Main array address: Mode 3
#define     FlashFR1_Mode3RP0StartAddress    0x10000000U
#define     FlashFR1_Mode3RP0EndAddress      0x100FFFFFU

#define     FlashFR2_Mode3RP0StartAddress    0x10400000U
#define     FlashFR2_Mode3RP0EndAddress      0x104FFFFFU

#define     FlashFR3_Mode3RP0StartAddress    0x10600000U
#define     FlashFR3_Mode3RP0EndAddress      0x106FFFFFU

#define     FlashFR3_Mode3RP1StartAddress    0x10700000U
#define     FlashFR3_Mode3RP1EndAddress      0x107FFFFFU

//Main array ECC address: Mode 3
#define     FlashFR1_Mode3RP0ECCStartAddress    0x10E00000U
#define     FlashFR1_Mode3RP0ECCEndAddress      0x10E1FFFFU
#define     FlashFR1_Mode3RP0ECCEndAddressPlus1 0x10E20000U

