TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/flash/uart_flash_kernel/flash_programming_F29H85x_C29.h
#define     FlashFR2_Mode3RP1ECCStartAddress    0x10E80000U
#define     FlashFR2_Mode3RP1ECCEndAddress      0x10E9FFFFU
#define     FlashFR2_Mode3RP1ECCEndAddressPlus1 0x10EA0000U

#define     FlashFR3_Mode3RP0ECCStartAddress    0x10EC0000U
#define     FlashFR3_Mode3RP0ECCEndAddress      0x10EDFFFFU
#define     FlashFR3_Mode3RP0ECCEndAddressPlus1 0x10EE0000U

#define     FlashFR3_Mode3RP1ECCStartAddress    0x10EE0000U
#define     FlashFR3_Mode3RP1ECCEndAddress      0x10EFFFFFU
#define     FlashFR3_Mode3RP1ECCEndAddressPlus1 0x10F00000U

//Non-Main array address: Mode 3
//BANKMGMT
#define     FlashFR1_Mode3RP0BankmgmtStartAddress    0x10D80000U
#define     FlashFR1_Mode3RP0BankmgmtEndAddress      0x10D80FFFU
#define     FlashFR1_Mode3RP0BankmgmtEndAddressPlus1 0x10D81000U
//SECCFG
#define     FlashFR1_Mode3RP0SeccfgStartAddress      0x10D81000U
#define     FlashFR1_Mode3RP0SeccfgEndAddress        0x10D81FFFU
#define     FlashFR1_Mode3RP0SeccfgEndAddressPlus1   0x10D82000U
//BANKMGMT
#define     FlashFR2_Mode3RP0BankmgmtStartAddress    0x10D90000U
#define     FlashFR2_Mode3RP0BankmgmtEndAddress      0x10D90FFFU
#define     FlashFR2_Mode3RP0BankmgmtEndAddressPlus1 0x10D91000U
//SECCFG
#define     FlashFR2_Mode3RP0SeccfgStartAddress      0x10D91000U
#define     FlashFR2_Mode3RP0SeccfgEndAddress       0x10D91FFFU
#define     FlashFR2_Mode3RP0SeccfgEndAddressPlus1   0x10D92000U
//BANKMGMT
#define     FlashFR3_Mode3RP0BankmgmtStartAddress    0x10D98000U
#define     FlashFR3_Mode3RP0BankmgmtEndAddress      0x10D98FFFU
#define     FlashFR3_Mode3RP0BankmgmtEndAddressPlus1 0x10D99000U
//SECCFG
#define     FlashFR3_Mode3RP0SeccfgStartAddress      0x10D99000U
#define     FlashFR3_Mode3RP0SeccfgEndAddress        0x10D99FFFU
#define     FlashFR3_Mode3RP0SeccfgEndAddressPlus1   0x10D9A000U
//BANKMGMT
#define     FlashFR3_Mode3RP1BankmgmtStartAddress    0x10D9C000U
#define     FlashFR3_Mode3RP1BankmgmtEndAddress      0x10D9CFFFU
#define     FlashFR3_Mode3RP1BankmgmtEndAddressPlus1 0x10D9D000U
//SECCFG
#define     FlashFR3_Mode3RP1SeccfgStartAddress      0x10D9D000U
#define     FlashFR3_Mode3RP1SeccfgEndAddress        0x10D9DFFFU
#define     FlashFR3_Mode3RP1SeccfgEndAddressPlus1   0x10D9E000U


//Non-Main ECC array address: Mode 3
//BANKMGMT ECC
#define     FlashFR1_Mode3RP0ECCBankmgmtStartAddress    0x10FC0000U
#define     FlashFR1_Mode3RP0ECCBankmgmtEndAddress      0x10FC01FFU
#define     FlashFR1_Mode3RP0ECCBankmgmtEndAddressPlus1 0x10FC0200U
//SECCFG
#define     FlashFR1_Mode3RP0ECCSeccfgStartAddress      0x10FC0200U
#define     FlashFR1_Mode3RP0ECCSeccfgEndAddress        0x10FC03FFU
#define     FlashFR1_Mode3RP0ECCSeccfgEndAddressPlus1   0x10FC0400U
//BANKMGMT
#define     FlashFR2_Mode3RP0ECCBankmgmtStartAddress    0x10FC0800U
#define     FlashFR2_Mode3RP0ECCBankmgmtEndAddress      0x10FC09FFU
#define     FlashFR2_Mode3RP0ECCBankmgmtEndAddressPlus1 0x10FC0A00U
//SECCFG
#define     FlashFR2_Mode3RP0ECCSeccfgStartAddress      0x10FC0A00U
#define     FlashFR2_Mode3RP0ECCSeccfgEndAddress        0x10FC0BFFU
#define     FlashFR2_Mode3RP0ECCSeccfgEndAddressPlus1   0x10FC0C00U
//BANKMGMT
#define     FlashFR3_Mode3RP0ECCBankmgmtStartAddress    0x10FC3000U
#define     FlashFR3_Mode3RP0ECCBankmgmtEndAddress      0x10FC31FFU
#define     FlashFR3_Mode3RP0ECCBankmgmtEndAddressPlus1 0x10FC3200U
//SECCFG
#define     FlashFR3_Mode3RP0ECCSeccfgStartAddress      0x10FC3200U
#define     FlashFR3_Mode3RP0ECCSeccfgEndAddress        0x10FC33FFU
#define     FlashFR3_Mode3RP0ECCSeccfgEndAddressPlus1   0x10FC3400U
//BANKMGMT
#define     FlashFR3_Mode3RP1ECCBankmgmtStartAddress    0x10FC3800U
#define     FlashFR3_Mode3RP1ECCBankmgmtEndAddress      0x10FC39FFU
#define     FlashFR3_Mode3RP1ECCBankmgmtEndAddressPlus1 0x10FC3A00U
//SECCFG
#define     FlashFR3_Mode3RP1ECCSeccfgStartAddress      0x10FC3A00U
#define     FlashFR3_Mode3RP1ECCSeccfgEndAddress        0x10FC3BFFU
#define     FlashFR3_Mode3RP1ECCSeccfgEndAddressPlus1   0x10FC3C00U

// HSM C29 view Bank0 Sector start addresses
#define     FlashC29HSMBank0StartAddress      0x60000000U
#define     BzeroC29Sector0_start         0x60000000U
#define     FlashBank0C29HSMEndAddress        0x600FFFFFU



//SOC Flash configuration Non-Main
    #define SOC_FR1_RP0_BANKMGMT_START       (uint32_t)(0x10D80000)
    #define SOC_FR1_RP0_BANKMGMT_END_PLUS1   (uint32_t)(0x10D81000)
    #define SOC_FR1_RP0_SECCFG_START         (uint32_t)(0x10D81000)
    #define SOC_FR1_RP0_SECCFG_END           (uint32_t)(0x10D81FFF)
    #define SOC_FR1_RP0_SECCFG_PLUS1         (uint32_t)(0x10D82000)

    #define SOC_FR1_RP1_BANKMGMT_START       (uint32_t)(0x10D84000)
    #define SOC_FR1_RP1_BANKMGMT_END_PLUS1   (uint32_t)(0x10D85000)
    #define SOC_FR1_RP1_SECCFG_START         (uint32_t)(0x10D85000)
    #define SOC_FR1_RP1_SECCFG_END           (uint32_t)(0x10D85FFF)
    #define SOC_FR1_RP1_SECCFG_PLUS1         (uint32_t)(0x10D86000)

    #define SOC_FR1_RP2_BANKMGMT_START       (uint32_t)(0x10D88000)
    #define SOC_FR1_RP2_BANKMGMT_END_PLUS1   (uint32_t)(0x10D89000)
    #define SOC_FR1_RP2_SECCFG_START         (uint32_t)(0x10D89000)
    #define SOC_FR1_RP2_SECCFG_END           (uint32_t)(0x10D89FFF)
    #define SOC_FR1_RP2_SECCFG_PLUS1         (uint32_t)(0x10D8A000)

    #define SOC_FR1_RP3_BANKMGMT_START       (uint32_t)(0x10D8C000)
    #define SOC_FR1_RP3_BANKMGMT_END_PLUS1   (uint32_t)(0x10D8D000)
    #define SOC_FR1_RP3_SECCFG_START         (uint32_t)(0x10D8D000)
    #define SOC_FR1_RP3_SECCFG_END           (uint32_t)(0x10D8DFFF)
    #define SOC_FR1_RP3_SECCFG_PLUS1         (uint32_t)(0x10D8E000)

    #define SOC_FR2_RP0_BANKMGMT_START       (uint32_t)(0x10D90000)
    #define SOC_FR2_RP0_BANKMGMT_END_PLUS1   (uint32_t)(0x10D91000)
    #define SOC_FR2_RP0_SECCFG_START         (uint32_t)(0x10D91000)
    #define SOC_FR2_RP0_SECCFG_END           (uint32_t)(0x10D91FFF)
    #define SOC_FR2_RP0_SECCFG_PLUS1         (uint32_t)(0x10D92000)

    #define SOC_FR2_RP1_BANKMGMT_START       (uint32_t)(0x10D94000)
    #define SOC_FR2_RP1_BANKMGMT_END_PLUS1   (uint32_t)(0x10D95000)
    #define SOC_FR2_RP1_SECCFG_START         (uint32_t)(0x10D95000)
    #define SOC_FR2_RP1_SECCFG_END           (uint32_t)(0x10D95FFF)
    #define SOC_FR2_RP1_SECCFG_PLUS1         (uint32_t)(0x10D96000)

#endif

#define     FlashC29BankOffset              0x100000U
#define     FlashC29sectorsize              0x1000
#define     FlashC29SECCFGBNKMGMTOffset     0x4000U

//Sector length in number of 16bits
#define Sector2KB_u16length                 0x200U
#define Bank256KB_u16length                 0x20000U

//Sector length in number of 32bits
#define Sector2KB_u32length                 0x200U
#define Bank256KB_u32length                 0x10000U

#endif /* FLASH_PROGRAMMING_F29H85XH_ */
